via/viaems/src/platforms/s32k344/s32k344_boot.c
  /* Interrupts */
  INT0_Handler,                                  /*   0 CPU to CPU int0 */
  INT1_Handler,                                  /*   1 CPU to CPU int1 */
  INT2_Handler,                                  /*   2 CPU to CPU int2 */
  INT3_Handler,                                  /*   3 CPU to CPU int3 */
  DMATCD0_Handler,                               /*   4 DMA transfer complete and error CH0 */
  DMATCD1_Handler,                               /*   5 DMA transfer complete and error CH1 */
  DMATCD2_Handler,                               /*   6 DMA transfer complete and error CH2 */
  DMATCD3_Handler,                               /*   7 DMA transfer complete and error CH3 */
  DMATCD4_Handler,                               /*   8 DMA transfer complete and error CH4 */
  DMATCD5_Handler,                               /*   9 DMA transfer complete and error CH5 */
  DMATCD6_Handler,                               /*  10 DMA transfer complete and error CH6 */
  DMATCD7_Handler,                               /*  11 DMA transfer complete and error CH7 */
  DMATCD8_Handler,                               /*  12 DMA transfer complete and error CH8 */
  DMATCD9_Handler,                               /*  13 DMA transfer complete and error CH9 */
  DMATCD10_Handler,                              /*  14 DMA transfer complete and error CH10 */
  DMATCD11_Handler,                              /*  15 DMA transfer complete and error CH11 */
  DMATCD12_Handler,                              /*  16 DMA transfer complete and error CH12 */
  DMATCD13_Handler,                              /*  17 DMA transfer complete and error CH13 */
  DMATCD14_Handler,                              /*  18 DMA transfer complete and error CH14 */
  DMATCD15_Handler,                              /*  19 DMA transfer complete and error CH15 */
  DMATCD16_Handler,                              /*  20 DMA transfer complete and error CH16 */
  DMATCD17_Handler,                              /*  21 DMA transfer complete and error CH17 */
  DMATCD18_Handler,                              /*  22 DMA transfer complete and error CH18 */
  DMATCD19_Handler,                              /*  23 DMA transfer complete and error CH19 */
  DMATCD20_Handler,                              /*  24 DMA transfer complete and error CH20 */
  DMATCD21_Handler,                              /*  25 DMA transfer complete and error CH21 */
  DMATCD22_Handler,                              /*  26 DMA transfer complete and error CH22 */
  DMATCD23_Handler,                              /*  27 DMA transfer complete and error CH23 */
  DMATCD24_Handler,                              /*  28 DMA transfer complete and error CH24 */
  DMATCD25_Handler,                              /*  29 DMA transfer complete and error CH25 */
  DMATCD26_Handler,                              /*  30 DMA transfer complete and error CH26 */
  DMATCD27_Handler,                              /*  31 DMA transfer complete and error CH27 */
  DMATCD28_Handler,                              /*  32 DMA transfer complete and error CH28 */
  DMATCD29_Handler,                              /*  33 DMA transfer complete and error CH29 */
  DMATCD30_Handler,                              /*  34 DMA transfer complete and error CH30 */
  DMATCD31_Handler,                              /*  35 DMA transfer complete and error CH31 */
  ERM_0_Handler,                                 /*  36 Single bit ECC error */
  ERM_1_Handler,                                 /*  37 Multi bit ECC error */
  MCM_Handler,                                   /*  38 Multi bit ECC error */
  STM0_Handler,                                  /*  39 Single interrupt vector for all four channels */
  STM1_Handler,                                  /*  40 Single interrupt vector for all four channels */
  RESERVED_Handler,                              /*  41 Reserved */
  SWT0_Handler,                                  /*  42 Platform watchdog initial time-out */
  RESERVED_Handler,                              /*  43 Reserved */
  RESERVED_Handler,                              /*  44 Reserved */
  CTI0_Handler,                                  /*  45 CTI Interrupt 0 */
  RESERVED_Handler,                              /*  46 Reserved */
  RESERVED_Handler,                              /*  47 Reserved */
  FLASH_0_Handler,                               /*  48 Program or erase operation is completed */
  FLASH_1_Handler,                               /*  49 Main watchdog timeout interrupt */
  FLASH_2_Handler,                               /*  50 Alternate watchdog timeout interrupt */
  RGM_Handler,                                   /*  51 Interrupt request to the system */
  PMC_Handler,                                   /*  52 One interrupt for all LVDs, One interrupt for all HVDs */
  SIUL_0_Handler,                                /*  53 External Interrupt Vector 0 */
  SIUL_1_Handler,                                /*  54 External Interrupt Vector 1 */
  SIUL_2_Handler,                                /*  55 External Interrupt Vector 2 */
  SIUL_3_Handler,                                /*  56 External Interrupt Vector 3 */
  RESERVED_Handler,                              /*  57 Reserved */
  RESERVED_Handler,                              /*  58 Reserved */
  RESERVED_Handler,                              /*  59 Reserved */
  RESERVED_Handler,                              /*  60 Reserved */
  EMIOS0_0_Handler,                              /*  61 Interrupt request 23,22,21,20 */
  EMIOS0_1_Handler,                              /*  62 Interrupt request 19,18,17,16 */
  EMIOS0_2_Handler,                              /*  63 Interrupt request 15,14,13,12 */
  EMIOS0_3_Handler,                              /*  64 Interrupt request 11,10,9,8 */
  EMIOS0_4_Handler,                              /*  65 Interrupt request 7,6,5,4 */
  EMIOS0_5_Handler,                              /*  66 Interrupt request 3,2,1,0 */
  RESERVED_Handler,                              /*  67 Reserved */
  RESERVED_Handler,                              /*  68 Reserved */
  EMIOS1_0_Handler,                              /*  69 Interrupt request 23,22,21,20 */
  EMIOS1_1_Handler,                              /*  70 Interrupt request 19,18,17,16 */
  EMIOS1_2_Handler,                              /*  71 Interrupt request 15,14,13,12 */
  EMIOS1_3_Handler,                              /*  72 Interrupt request 11,10,9,8 */
  EMIOS1_4_Handler,                              /*  73 Interrupt request 7,6,5,4 */
  EMIOS1_5_Handler,                              /*  74 Interrupt request 3,2,1,0 */
  RESERVED_Handler,                              /*  75 Reserved */
  RESERVED_Handler,                              /*  76 Reserved */
  EMIOS2_0_Handler,                              /*  77 Interrupt request 23,22,21,20 */
  EMIOS2_1_Handler,                              /*  78 Interrupt request 19,18,17,16 */
  EMIOS2_2_Handler,                              /*  79 Interrupt request 15,14,13,12 */
  EMIOS2_3_Handler,                              /*  80 Interrupt request 11,10,9,8 */
  EMIOS2_4_Handler,                              /*  81 Interrupt request 7,6,5,4 */
  EMIOS2_5_Handler,                              /*  82 Interrupt request 3,2,1,0 */
  WKPU_Handler,                                  /*  83 Interrupts from pad group 0,1,2,3, Interrupts from pad group 0_64, Interrupts from pad group 1_64, Interrupts from pad group 2_64, Interrupts from pad group 3_64 */
  CMU0_Handler,                                  /*  84 CMU0 interrupt */
  CMU1_Handler,                                  /*  85 CMU1 interrupt */
  CMU2_Handler,                                  /*  86 CMU2 interrupt */
  BCTU_Handler,                                  /*  87 An interrupt is requested when a conversion is issued to the ADC, An interrupt is requested when new data is available from ADC0 conversion, An interrupt is requested when new data is available from ADC1 conversion, An interrupt is requested when new data is available from ADC2 conversion, An interrupt is requested when the last command of a list is issued to the ADC,An Interrupt output for FIFO1,An Interrupt output for FIFO2 */
  RESERVED_Handler,                              /*  88 Reserved */
  RESERVED_Handler,                              /*  89 Reserved */
  RESERVED_Handler,                              /*  90 Reserved */
  RESERVED_Handler,                              /*  91 Reserved */
  LCU0_Handler,                                  /*  92 Interrupt 0, Interrupt 1 Interrupt 2 */
  LCU1_Handler,                                  /*  93 Interrupt 0, Interrupt 1 Interrupt 2 */
  RESERVED_Handler,                              /*  94 Reserved */
  RESERVED_Handler,                              /*  95 Reserved */
  PIT0_Handler,                                  /*  96 Interrupt for Channel0,Interrupt for Channel1,Interrupt for Channel2,Interrupt for Channel3,Interrupt for Channel4 */
  PIT1_Handler,                                  /*  97 Interrupt for Channel0,Interrupt for Channel1,Interrupt for Channel2,Interrupt for Channel3 */
  PIT2_Handler,                                  /*  98 Interrupt for Channel0,Interrupt for Channel1,Interrupt for Channel2,Interrupt for Channel3 */
  RESERVED_Handler,                              /*  99 Reserved */
  RESERVED_Handler,                              /* 100 Reserved */
  RESERVED_Handler,                              /* 101 Reserved */
  RTC_Handler,                                   /* 102 RTCF or ROVRF interrupt to be serviced by the system controller, APIF interrupt to be serviced by the system controller */
  RESERVED_Handler,                              /* 103 Reserved */
  RESERVED_Handler,                              /* 104 Reserved */
  EMAC_0_Handler,                                /* 105 Common interrupt */
  EMAC_1_Handler,                                /* 106 Tx interrupt 0, Tx interrupt 1 */
  EMAC_2_Handler,                                /* 107 Rx interrupt 0, Rx interrupt 1 */
  EMAC_3_Handler,                                /* 108 Safety interrupt correctable, Safety interrupt un-correctable */
  FlexCAN0_0_Handler,                            /* 109 Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN0_1_Handler,                            /* 110 Message Buffer Interrupt line 0-31,ORed Interrupt for Message Buffers */
  FlexCAN0_2_Handler,                            /* 111 Message Buffer Interrupt line 32-63 */
  FlexCAN0_3_Handler,                            /* 112 Message Buffer Interrupt line 64-95 */
  FlexCAN1_0_Handler,                            /* 113 Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN1_1_Handler,                            /* 114 Message Buffer Interrupt line 0-31 */
  FlexCAN1_2_Handler,                            /* 115 Message Buffer Interrupt line 32-63 */
  FlexCAN2_0_Handler,                            /* 116 Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN2_1_Handler,                            /* 117 Message Buffer Interrupt line 0-31 */
  FlexCAN2_2_Handler,                            /* 118 Message Buffer Interrupt line 32-63 */
  FlexCAN3_0_Handler,                            /* 119 Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN3_1_Handler,                            /* 120 Message Buffer Interrupt line 0-31 */
  FlexCAN4_0_Handler,                            /* 121 Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN4_1_Handler,                            /* 122 Message Buffer Interrupt line 0-31 */
  FlexCAN5_0_Handler,                            /* 123 Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN5_1_Handler,                            /* 124 Message Buffer Interrupt line 0-31 */
  RESERVED_Handler,                              /* 125 Reserved */
  RESERVED_Handler,                              /* 126 Reserved */
  RESERVED_Handler,                              /* 127 Reserved */
  RESERVED_Handler,                              /* 128 Reserved */
  RESERVED_Handler,                              /* 129 Reserved */
  RESERVED_Handler,                              /* 130 Reserved */
  RESERVED_Handler,                              /* 131 Reserved */
  RESERVED_Handler,                              /* 132 Reserved */
  RESERVED_Handler,                              /* 133 Reserved */
  RESERVED_Handler,                              /* 134 Reserved */
  RESERVED_Handler,                              /* 135 Reserved */
  RESERVED_Handler,                              /* 136 Reserved */
  RESERVED_Handler,                              /* 137 Reserved */
  RESERVED_Handler,                              /* 138 Reserved */
  FLEXIO_Handler,                                /* 139 FlexIO Interrupt */
  RESERVED_Handler,                              /* 140 Reserved */
  LPUART0_Handler,                               /* 141 TX and RX interrupt */
  LPUART1_Handler,                               /* 142 TX and RX interrupt */
  LPUART2_Handler,                               /* 143 TX and RX interrupt */
  LPUART3_Handler,                               /* 144 TX and RX interrupt */
  LPUART4_Handler,                               /* 145 TX and RX interrupt */
  LPUART5_Handler,                               /* 146 TX and RX interrupt */
  LPUART6_Handler,                               /* 147 TX and RX interrupt */
  LPUART7_Handler,                               /* 148 TX and RX interrupt */
  LPUART8_Handler,                               /* 149 TX and RX interrupt */
  LPUART9_Handler,                               /* 150 TX and RX interrupt */
  LPUART10_Handler,                              /* 151 TX and RX interrupt */
  LPUART11_Handler,                              /* 152 TX and RX interrupt */
  LPUART12_Handler,                              /* 153 TX and RX interrupt */
  LPUART13_Handler,                              /* 154 TX and RX interrupt */
  LPUART14_Handler,                              /* 155 TX and RX interrupt */
  LPUART15_Handler,                              /* 156 TX and RX interrupt */
  RESERVED_Handler,                              /* 157 Reserved */
  RESERVED_Handler,                              /* 158 Reserved */
  RESERVED_Handler,                              /* 159 Reserved */
  RESERVED_Handler,                              /* 160 Reserved */
  LPI2C0_Handler,                                /* 161 LPI2C Master Interrupt, LPI2C Interrupt */
  LPI2C1_Handler,                                /* 162 LPI2C Master Interrupt, LPI2C Interrupt */
  RESERVED_Handler,                              /* 163 Reserved */
  RESERVED_Handler,                              /* 164 Reserved */
  LPSPI0_Handler,                                /* 165 LPSPI Interrupt */
  LPSPI1_Handler,                                /* 166 LPSPI Interrupt */
  LPSPI2_Handler,                                /* 167 LPSPI Interrupt */
  LPSPI3_Handler,                                /* 168 LPSPI Interrupt */
  LPSPI4_Handler,                                /* 169 LPSPI Interrupt */
  LPSPI5_Handler,                                /* 170 LPSPI Interrupt */
  RESERVED_Handler,                              /* 171 Reserved */
  RESERVED_Handler,                              /* 172 Reserved */
  QSPI_Handler,                                  /* 173 TX Buffer Fill interrupt, Transfer Complete / Transaction Finished, RX Buffer Drain interrupt, Buffer Overflow / Underrun interrupt, Serial Flash Communication Error interrupt, All interrupts ORed output */
  SAI0_Handler,                                  /* 174 RX interrupt,TX interrupt */
  SAI1_Handler,                                  /* 175 RX interrupt,TX interrupt */
  RESERVED_Handler,                              /* 176 Reserved */
  RESERVED_Handler,                              /* 177 Reserved */
  JDC_Handler,                                   /* 178 Indicates new data to be read from JIN_IPS register or can be written to JOUT_IPS register */
  RESERVED_Handler,                              /* 179 Reserved */
  ADC0_Handler,                                  /* 180 End of conversion, Error interrupt, Watchdog interrupt */
  ADC1_Handler,                                  /* 181 End of conversion, Error interrupt, Watchdog interrupt */
  ADC2_Handler,                                  /* 182 End of conversion, Error interrupt, Watchdog interrupt */
  LPCMP0_Handler,                                /* 183 Async interrupt */
  LPCMP1_Handler,                                /* 184 Async interrupt */
  LPCMP2_Handler,                                /* 185 Async interrupt */
  RESERVED_Handler,                              /* 186 Reserved */
  RESERVED_Handler,                              /* 187 Reserved */
  RESERVED_Handler,                              /* 188 Reserved */
  FCCU_0_Handler,                                /* 189 Interrupt request(ALARM state) */
  FCCU_1_Handler,                                /* 190 Interrupt request(miscellaneous conditions) */
  STCU_LBIST_MBIST_Handler,                      /* 191 Interrupt request(miscellaneous conditions) */
  HSE_MU0_TX_Handler,                            /* 192 ORed TX interrupt to MU-0 */
  HSE_MU0_RX_Handler,                            /* 193 ORed RX interrupt to MU-0 */
  HSE_MU0_ORED_Handler,                          /* 194 ORed general purpose interrupt request to MU-0 */
  HSE_MU1_TX_Handler,                            /* 195 ORed TX interrupt to MU-1 */
  HSE_MU1_RX_Handler,                            /* 196 ORed RX interrupt to MU-1 */
  HSE_MU1_ORED_Handler,                          /* 197 ORed general purpose interrupt request to MU-1 */
  RESERVED_Handler,                              /* 198 Reserved */
  RESERVED_Handler,                              /* 199 Reserved */
  RESERVED_Handler,                              /* 200 Reserved */
  RESERVED_Handler,                              /* 201 Reserved */
  RESERVED_Handler,                              /* 202 Reserved */
  RESERVED_Handler,                              /* 203 Reserved */
  RESERVED_Handler,                              /* 204 Reserved */
  RESERVED_Handler,                              /* 205 Reserved */
  RESERVED_Handler,                              /* 206 Reserved */
  RESERVED_Handler,                              /* 207 Reserved */
  RESERVED_Handler,                              /* 208 Reserved */
  RESERVED_Handler,                              /* 209 Reserved */
  RESERVED_Handler,                              /* 210 Reserved */
  RESERVED_Handler,                              /* 211 Reserved */
  SoC_PLL_Handler                                /* 212 PLL LOL interrupt */
};

void __attribute__((naked)) DisableSWT0(void) {
  return;
}

void __attribute__((naked))  InitECC(void) {
  __asm__(
"        LDR      R2,=0\n"
"        LDR      R3,=0\n"
"        LDR      R4,=0x20400000\n"
"        LDR      R5,=0x50000\n"
"        \n"
"        LSRS     R5,R5,#3\n"
"SRAM_Loop:\n"
"        STRD     r2,r3,[R4,#0]\n"
"        ADDS     R4,R4,#0x08\n"
"        SUBS     R5,R5,#1\n"
"        CMP      R5,#0x00\n"
"        BNE      SRAM_Loop\n"
"\n"
"        // Initialize DTCM\n"
"        LDR      R2,=0\n"
"        LDR      R3,=0\n"
"        LDR      R4,=0x20000000\n"
"        LDR      R5,=0x20000\n"
"        \n"
"        LSRS     R5,R5,#3\n"
"DTCM_Loop:\n"
"        STRD     r2,r3,[R4,#0]\n"
"        ADDS     R4,R4,#0x08\n"
"        SUBS     R5,R5,#1\n"
"        CMP      R5,#0x00\n"
"        BNE      DTCM_Loop\n"
"\n"
"        BX       LR                     // Return\n"
  );

