via/viaems/src/platforms/s32k344/s32k344_boot.c
}

void SystemInit (void)
{

  SCB->VTOR = (uint32_t) &(__VECTOR_TABLE[0]);
  SCB->CPACR |= ((3U << 10U*2U) |           /* enable CP10 Full Access */
                 (3U << 11U*2U)  );         /* enable CP11 Full Access */

  SCB->CCR |= SCB_CCR_UNALIGN_TRP_Msk;
}

extern int main(void);

void __attribute__((naked)) Reset_Handler(void)
{
  __disable_irq();
  DisableSWT0();
  InitECC();
  __enable_irq();

  SystemInit();                             /* CMSIS System Initialization */
  main();
}


/*----------------------------------------------------------------------------
  Hard Fault Handler
 *----------------------------------------------------------------------------*/
void HardFault_Handler(void)
{
  while(1);
}

/*----------------------------------------------------------------------------
  Default Handler for Exceptions / Interrupts
 *----------------------------------------------------------------------------*/
void Default_Handler(void)
{
  while(1);
}



#include "S32K3xx_lc_xrdc_config.h"
#include "S32K3xx_bootheader.h"
extern const lc_config_t    lc_config;  
const lc_config_t    lc_config   __attribute__((section (".lc_xrdc_config"), used)) = {
             0xFFFFFFFF
};
       
extern 
const xrdc_config_t  xrdc_config;
const xrdc_config_t  xrdc_config __attribute__((section (".lc_xrdc_config"), used)) = {
  .Header =  0xFFFFFFFF
};

extern const S32K3xx_bootheader_t boot_header;
       const S32K3xx_bootheader_t boot_header __attribute__((section (".bootheader"),used)) = {
  .Header             =               0x5AA55AA5,  /* valid  boot header marker */
  .BootConfig         =                        1,  /* bit 0: CM7_0_ENABLE; Cortex-M7_0 application core clock ungated after boot */
                                                   /* bit 1: CM7_1_ENABLE; Cortex-M7_1 application core clock ungated after boot */
                                                   /* bit 3: BOOT_SEQ;     Secure Boot application image is executed by HSE after authentication */
                                                   /* bit 5: APP_SWT_INIT; SBAF initializes SWT0 before enabling the application cores */
  .CM7_0_StartAddress = (const void *)0x400000,
  .CM7_1_StartAddress = (const void *)0,
  .XRDC_ConfigAddress = (const void *)&xrdc_config,
  .LC_ConfigAddress   = (const void *)&lc_config
};
